Paquetes.org
#+TITLE:     Crear paquetes en R

#+SETUPFILE: config.org
#+OPTIONS: H:2


* Introducción

** Definiciones previas ([[http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf][Creating R Packages: a tutorial]])
- *Package*: An extension of the R base system with code, data and
  documentation in standardized format.
- *Library*: A directory containing installed packages.
- *Repository*: A website providing packages for installation.

** Definiciones previas ([[http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf][Creating R Packages: a tutorial]])
- *Source*: The original version of a package with human-readable text and code.
- *Binary*: A compiled version of a package with computer-readable
  text and code, may work only on a specific platform.

** Definiciones previas ([[http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf][Creating R Packages: a tutorial]])
- *Base packages*: Part of the R source tree, maintained by R Core.
- *Recommended packages*: Part of every R installation, but not
  necessarily maintained by R Core.
- *Contributed packages*: All the rest. 

** ¿Por qué crear y publicar un paquete para =R=?

*** Organización
 - Es una herramienta cómoda para mantener *colecciones coherentes de funciones y datos*.
 - La estructura de un paquete *obliga a organizar, limpiar y documentar* el código.

** ¿Por qué crear y publicar un paquete para =R=?

*** Colaboración
 - Permite publicar código de forma que pueda ser *empleado por otros* siguiendo unas *estructuras comunes*.
 - Al distribuir las herramientas para que otros puedan usarlas, se obtiene *realimentación sobre lo publicado*, de forma que se aumenta su *robustez*, se *amplian sus funcionalidades* y se *conecta con otras herramientas* y proyectos.

** ¿Por qué crear y publicar un paquete para =R=?

*** Ética
"As we enjoy great advantages from the inventions of others, we should be glad of an opportunity to serve others by any invention of ours, and this we should do freely and generously." (B. Franklin)

** Algunos consejos genéricos

Extraído de [[http://arxiv.org/abs/1210.0530][Best Practices for Scientific Computing]]

- Write programs for people, not computers.
- Automate repetitive tasks
- Use the computer to record history
- Make incremental changes
- Use version control
- Don't repeat yourself (or others)
- Plan for mistakes
- Optimize software only after it works correctly
- Document design and purpose, not mechanics
- Collaborate

** 
*** Referencias							    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- [[http://cran.r-project.org/doc/manuals/r-release/R-exts.html][Writing R Extensions]]
- [[http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf][Creating R Packages: a tutorial]]
- [[http://kbroman.org/pkg_primer/][R package primer]]
- [[http://portal.stats.ox.ac.uk/userdata/ruth/APTS2012/Rcourse10.pdf][Making an R package]]

* Crear un paquete en R

** Estructura
Las fuentes de un paquete de =R= están contenidas en un directorio que contiene al menos:
  - Los ficheros DESCRIPTION y NAMESPACE
  - Los subdirectorios:
    - =R=: código en ficheros .R
    - =man=: páginas de ayuda de las funciones, métodos y clases
      contenidos en el paquete.
Esta estructura puede ser generada con =package.skeleton=

