docs/Paquetes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2017-07-05 mié 16:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Crear paquetes en R</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Oscar Perpiñán Lamigueiro \\ http://oscarperpinan.github.io" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Crear paquetes en R</h1>


<div id="outline-container-org861461a" class="outline-2">
<h2 id="org861461a"><span class="section-number-2">1</span> Introducción</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgb7b1fd9" class="outline-3">
<h3 id="orgb7b1fd9"><span class="section-number-3">1.1</span> Definiciones previas (<a href="http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf">Creating R Packages: a tutorial</a>)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Package</b>: An extension of the R base system with code, data and
documentation in standardized format.</li>
<li><b>Library</b>: A directory containing installed packages.</li>
<li><b>Repository</b>: A website providing packages for installation.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbad65b7" class="outline-3">
<h3 id="orgbad65b7"><span class="section-number-3">1.2</span> Definiciones previas (<a href="http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf">Creating R Packages: a tutorial</a>)</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>Source</b>: The original version of a package with human-readable text and code.</li>
<li><b>Binary</b>: A compiled version of a package with computer-readable
text and code, may work only on a specific platform.</li>
</ul>
</div>
</div>

<div id="outline-container-org64ead73" class="outline-3">
<h3 id="org64ead73"><span class="section-number-3">1.3</span> Definiciones previas (<a href="http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf">Creating R Packages: a tutorial</a>)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Base packages</b>: Part of the R source tree, maintained by R Core.</li>
<li><b>Recommended packages</b>: Part of every R installation, but not
necessarily maintained by R Core.</li>
<li><b>Contributed packages</b>: All the rest.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1d2da6" class="outline-3">
<h3 id="orgb1d2da6"><span class="section-number-3">1.4</span> ¿Por qué crear y publicar un paquete para <code>R</code>?</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Es una herramienta cómoda para mantener colecciones coherentes de funciones
y datos.</li>
<li>Permite publicar código de forma que pueda ser empleado por
otros siguiendo unas estructuras comunes.</li>
<li>La estructura de un paquete obliga a organizar, limpiar y
documentar el código.</li>
<li>Al distribuir las herramientas para que otros puedan usarlas, se
obtiene realimentación sobre lo publicado, de forma que se
aumenta su robustez, se amplian sus funcionalidades y se conecta
con otras herramientas y proyectos.</li>
<li>&laquo;As we enjoy great advantages from the inventions of others, we
should be glad of an opportunity to serve others by any
invention of ours, and this we should do freely and generously.&raquo;</li>
</ul>
</div>
</div>

<div id="outline-container-org1e64a1e" class="outline-3">
<h3 id="org1e64a1e"><span class="section-number-3">1.5</span> Algunos consejos genéricos</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Extraído de <a href="http://arxiv.org/abs/1210.0530">Best Practices for Scientific Computing</a>
</p>

<ul class="org-ul">
<li>Write programs for people, not computers.</li>
<li>Automate repetitive tasks</li>
<li>Use the computer to record history</li>
<li>Make incremental changes</li>
<li>Use version control</li>
<li>Don&rsquo;t repeat yourself (or others)</li>
<li>Plan for mistakes</li>
<li>Optimize software only after it works correctly</li>
<li>Document design and purpose, not mechanics</li>
<li>Collaborate</li>
</ul>
</div>
</div>

<div id="outline-container-org66b5beb" class="outline-3">
<h3 id="org66b5beb"><span class="section-number-3">1.6</span> </h3>
<div class="outline-text-3" id="text-1-6">
</div><ol class="org-ol"><li><a id="org3b8a0e8"></a>Referencias&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_block">B_block</span></span><br /><div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li><a href="http://cran.r-project.org/doc/manuals/r-release/R-exts.html">Writing R Extensions</a></li>
<li><a href="http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf">Creating R Packages: a tutorial</a></li>
<li><a href="http://kbroman.org/pkg_primer/">R package primer</a></li>
<li><a href="http://portal.stats.ox.ac.uk/userdata/ruth/APTS2012/Rcourse10.pdf">Making an R package</a></li>
</ul>
</div></li></ol>
</div>
</div>

<div id="outline-container-orgc80fd7d" class="outline-2">
<h2 id="orgc80fd7d"><span class="section-number-2">2</span> Crear un paquete en R</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgd7371eb" class="outline-3">
<h3 id="orgd7371eb"><span class="section-number-3">2.1</span> Estructura</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Las fuentes de un paquete de <code>R</code> están contenidas en un
directorio que contiene al menos:
<ul class="org-ul">
<li>Los ficheros DESCRIPTION y NAMESPACE</li>
<li>Los subdirectorios:
<ul class="org-ul">
<li><code>R</code>: código en ficheros .R</li>
<li><code>man</code>: páginas de ayuda de las funciones, métodos y clases
contenidos en el paquete.</li>
</ul></li>
</ul></li>
<li>Esta estructura puede ser generada con <code>package.skeleton</code>.</li>
</ul>
</div>
</div>
