docs/Paquetes.tex
% Created 2017-07-05 mié 16:25
% Intended LaTeX compiler: pdflatex
\documentclass[xcolor={usenames,svgnames,dvipsnames}]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage[spanish]{babel}
\usecolortheme{rose}
\setbeamercolor{alerted text}{fg=Blue}
\setbeamerfont{alerted text}{series=\bfseries}
\setbeamercolor{block title}{bg=structure.fg!20!bg!50!bg}
\setbeamercolor{block body}{use=block title,bg=block title.bg}
\setbeamertemplate{navigation symbols}{}
\AtBeginSubsection[]{\begin{frame}[plain]\tableofcontents[currentsubsection,sectionstyle=show/shaded,subsectionstyle=show/shaded/hide]\end{frame}}
\lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1, showstringspaces=false}
\usepackage{mathpazo}
\hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
\usepackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\tiny, formatcom = {\color{black!70}}}
\usetheme{Goettingen}
\usefonttheme{serif}
\author{Oscar Perpiñán Lamigueiro $\backslash$\ \url{http://oscarperpinan.github.io}}
\date{}
\title{Crear paquetes en R}
\hypersetup{
 pdfauthor={Oscar Perpiñán Lamigueiro $\backslash$\ \url{http://oscarperpinan.github.io}},
 pdftitle={Crear paquetes en R},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.5)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle


\section{Introducción}
\label{sec:org0553dcb}

\begin{frame}[label={sec:org6801f7e}]{Definiciones previas (\href{http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf}{Creating R Packages: a tutorial})}
\begin{itemize}
\item \alert{Package}: An extension of the R base system with code, data and
documentation in standardized format.
\item \alert{Library}: A directory containing installed packages.
\item \alert{Repository}: A website providing packages for installation.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org70070c2}]{Definiciones previas (\href{http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf}{Creating R Packages: a tutorial})}
\begin{itemize}
\item \alert{Source}: The original version of a package with human-readable text and code.
\item \alert{Binary}: A compiled version of a package with computer-readable
text and code, may work only on a specific platform.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf957f28}]{Definiciones previas (\href{http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf}{Creating R Packages: a tutorial})}
\begin{itemize}
\item \alert{Base packages}: Part of the R source tree, maintained by R Core.
\item \alert{Recommended packages}: Part of every R installation, but not
necessarily maintained by R Core.
\item \alert{Contributed packages}: All the rest.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:org1b29473}]{¿Por qué crear y publicar un paquete para \texttt{R}?}
 \begin{itemize}
\item Es una herramienta cómoda para mantener colecciones coherentes de funciones
y datos.
\item Permite publicar código de forma que pueda ser empleado por
otros siguiendo unas estructuras comunes.
\item La estructura de un paquete obliga a organizar, limpiar y
documentar el código.
\item Al distribuir las herramientas para que otros puedan usarlas, se
obtiene realimentación sobre lo publicado, de forma que se
aumenta su robustez, se amplian sus funcionalidades y se conecta
con otras herramientas y proyectos.
\item \guillemotleft{}As we enjoy great advantages from the inventions of others, we
should be glad of an opportunity to serve others by any
invention of ours, and this we should do freely and generously.\guillemotright{}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org749764a}]{Algunos consejos genéricos}
Extraído de \href{http://arxiv.org/abs/1210.0530}{Best Practices for Scientific Computing}

\begin{itemize}
\item Write programs for people, not computers.
\item Automate repetitive tasks
\item Use the computer to record history
\item Make incremental changes
\item Use version control
\item Don't repeat yourself (or others)
\item Plan for mistakes
\item Optimize software only after it works correctly
\item Document design and purpose, not mechanics
\item Collaborate
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5a436d7}]{}
\begin{block}{Referencias}
\begin{itemize}
\item \href{http://cran.r-project.org/doc/manuals/r-release/R-exts.html}{Writing R Extensions}
\item \href{http://cran.r-project.org/doc/contrib/Leisch-CreatingPackages.pdf}{Creating R Packages: a tutorial}
\item \href{http://kbroman.org/pkg\_primer/}{R package primer}
\item \href{http://portal.stats.ox.ac.uk/userdata/ruth/APTS2012/Rcourse10.pdf}{Making an R package}
\end{itemize}
\end{block}
\end{frame}

\section{Crear un paquete en R}
\label{sec:orgbdf9885}

\begin{frame}[fragile,label={sec:org092fef2}]{Estructura}
 \begin{itemize}
\item Las fuentes de un paquete de \texttt{R} están contenidas en un
directorio que contiene al menos:
\begin{itemize}
\item Los ficheros DESCRIPTION y NAMESPACE
\item Los subdirectorios:
\begin{itemize}
\item \texttt{R}: código en ficheros .R
\item \texttt{man}: páginas de ayuda de las funciones, métodos y clases
contenidos en el paquete.
\end{itemize}
\end{itemize}
\item Esta estructura puede ser generada con \texttt{package.skeleton}.
\end{itemize}
\end{frame}
