Paquetes.org
** DESCRIPTION
El fichero DESCRIPTION contiene la información básica:
#+begin_example
     Package: pkgname
     Version: 0.5-1
     Date: 2004-01-01
     Title: My First Collection of Functions
     Authors@R: c(person("Joe", "Developer", role = c("aut", "cre"),
                          email = "Joe.Developer@some.domain.net"),
                   person("Pat", "Developer", role = "aut"),
                   person("A.", "User", role = "ctb",
     	             email = "A.User@whereever.net"))
     Author: Joe Developer and Pat Developer, with contributions from A. User
     Maintainer: Joe Developer <Joe.Developer@some.domain.net>
     Depends: R (>= 1.8.0), nlme
     Suggests: MASS
     Description: A short (one paragraph) description of what
       the package does and why it may be useful.
     License: GPL (>= 2)
     URL: http://www.r-project.org, http://www.another.url
#+end_example
- Los campos =Package=, =Version=, =License=, =Title=, =Author= y
  =Maintainer= son obligatorios.
- Si usa métodos =S4= debe incluir =Depends: methods=
** NAMESPACE
- =R= usa un sistema de gestión de *espacio de nombres* que
  permite al autor del paquete especificar:
  - las *variables* del paquete que se *exportan* (y son, por tanto,
    accesibles a los usuarios)
  - las *variables* que se *importan* de otros paquetes.
  - las *clases y métodos* =S3= y =S4= que deben registrarse.
- Este mecanismo queda definido en el contenido del fichero
  =NAMESPACE=.
** NAMESPACE
El =NAMESPACE= controla la estrategia de búsqueda de variables
  que utilizan las funciones del paquete:
  1. En primer lugar busca entre las creadas localmente (por el código de la carpeta =R/=).
  2. En segundo lugar busca entre las variables importadas
    explícitamente de otros paquetes.
  3. En tercer lugar busca en el =NAMESPACE= del paquete =base=.
  4. Por último busca siguiendo el camino habitual (ver el
    resultado de =search()=)

** NAMESPACE: variables
- Para exportar las variables =f= y =g=:
#+begin_src R 
export(f, g)
#+end_src
- Para importar *todas* las variables del paquete =pkgExt=:
#+begin_src R 
import(pkgExt)
#+end_src
- Para importar las variables =var1= y =var2= del paquete
  =pkgExt=:
#+begin_src R 
importFrom(pkgExt, var1, var2)
#+end_src

** NAMESPACE: clases y métodos
- Para registrar el método =S3= =print= para la clase =myClass=:
#+begin_src R 
S3method(print, myClass)
#+end_src
- Para usar clases y métodos =S4=
#+begin_src R
import("methods")
#+end_src
- Para registrar las clases =S4= =class1= y =class2=:
#+begin_src R 
exportClasses(class1, class2)
#+end_src
- Para registrar los métodos =S4= =method1= y =method2=:
#+begin_src R 
exportMethods(method1, method2)
#+end_src
- Para importar métodos y clases =S4= de otro paquete:
#+begin_src R 
importClassesFrom(package, ...)
importMethodsFrom(package, ...)
#+end_src

** Documentación 
- Las páginas de ayuda de los objetos =R= se escriben usando el
  formato “R documentation” (Rd), un lenguaje similar a LaTeX.
- Es aconsejable seguir estas orientaciones: [[http://developer.r-project.org/Rds.html][Guidelines for Rd files]]
- Para generar el esqueleto de un fichero Rd es aconsejable usar:
  - =prompt=: [[http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-functions][genérica]]
  - =promptClass= y =promptMethods=: [[http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-S4-classes-and-methods][clases y métodos]].
  - =promptPackage=: [[http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-packages][paquete]]
  - =promptData=: [[http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-data-sets][datos]]
- Todos los comandos disponibles están en el documento [[http://developer.r-project.org/parseRd.pdf][Parsing Rd files]].

