docs/Paquetes.html

<div id="outline-container-org07e0ba5" class="outline-3">
<h3 id="org07e0ba5"><span class="section-number-3">2.2</span> DESCRIPTION</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>El fichero DESCRIPTION contiene la información básica:</li>
</ul>
<pre class="example">
     Package: pkgname
     Version: 0.5-1
     Date: 2004-01-01
     Title: My First Collection of Functions
     Authors@R: c(person("Joe", "Developer", role = c("aut", "cre"),
                          email = "Joe.Developer@some.domain.net"),
                   person("Pat", "Developer", role = "aut"),
                   person("A.", "User", role = "ctb",
     	             email = "A.User@whereever.net"))
     Author: Joe Developer and Pat Developer, with contributions from A. User
     Maintainer: Joe Developer &lt;Joe.Developer@some.domain.net&gt;
     Depends: R (&gt;= 1.8.0), nlme
     Suggests: MASS
     Description: A short (one paragraph) description of what
       the package does and why it may be useful.
     License: GPL (&gt;= 2)
     URL: http://www.r-project.org, http://www.another.url
</pre>
<ul class="org-ul">
<li>Los campos <code>Package</code>, <code>Version</code>, <code>License</code>, <code>Title</code>, <code>Author</code> y
<code>Maintainer</code> son obligatorios.</li>
<li>Si usa métodos <code>S4</code> debe incluir <code>Depends: methods</code></li>
</ul>
</div>
</div>
<div id="outline-container-org9ced274" class="outline-3">
<h3 id="org9ced274"><span class="section-number-3">2.3</span> NAMESPACE</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><code>R</code> usa un sistema de gestión de <i>espacio de nombres</i> que
permite al autor del paquete especificar:
<ul class="org-ul">
<li>las variables del paquete que se exportan (y son, por tanto,
accesibles a los usuarios)</li>
<li>las variables que se importan de otros paquetes.</li>
<li>las clases y métodos <code>S3</code> y <code>S4</code> que deben registrarse.</li>
</ul></li>
<li>Este mecanismo queda definido en el contenido del fichero
<code>NAMESPACE</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org4ba98ab" class="outline-3">
<h3 id="org4ba98ab"><span class="section-number-3">2.4</span> NAMESPACE</h3>
<div class="outline-text-3" id="text-2-4">
<p>
El <code>NAMESPACE</code> controla la estrategia de búsqueda de variables
  que utilizan las funciones del paquete:
</p>
<ul class="org-ul">
<li>En primer lugar busca entre las creadas localmente (por el código de la carpeta <code>R/</code>).</li>
<li>En segundo lugar busca entre las variables importadas
explícitamente de otros paquetes.</li>
<li>En tercer lugar busca en el <code>NAMESPACE</code> del paquete <code>base</code>.</li>
<li>Por último busca siguiendo el camino habitual (ver el
resultado de <code>search()</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org322d54e" class="outline-3">
<h3 id="org322d54e"><span class="section-number-3">2.5</span> NAMESPACE</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Para exportar las variables <code>f</code> y <code>g</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">export(f, g)
</pre>
</div>
<ul class="org-ul">
<li>Para importar <b>todas</b> las variables del paquete <code>pkgExt</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">import(pkgExt)
</pre>
</div>
<ul class="org-ul">
<li>Para importar las variables <code>var1</code> y <code>var2</code> del paquete
<code>pkgExt</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">importFrom(pkgExt, var1, var2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga070f43" class="outline-3">
<h3 id="orga070f43"><span class="section-number-3">2.6</span> NAMESPACE</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Para registrar el método <code>S3</code> <code>print</code> para la clase <code>myClass</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">S3method(print, myClass)
</pre>
</div>
<ul class="org-ul">
<li>Para usar clases y métodos <code>S4</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-R">import(<span class="org-string">"methods"</span>)
</pre>
</div>
<ul class="org-ul">
<li>Para registrar las clases <code>S4</code> <code>class1</code> y <code>class2</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">exportClasses(class1, class2)
</pre>
</div>
<ul class="org-ul">
<li>Para registrar los métodos <code>S4</code> <code>method1</code> y <code>method2</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">exportMethods(method1, method2)
</pre>
</div>
<ul class="org-ul">
<li>Para importar métodos y clases <code>S4</code> de otro paquete:</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">importClassesFrom(package, ...)
importMethodsFrom(package, ...)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e9c971" class="outline-3">
<h3 id="org2e9c971"><span class="section-number-3">2.7</span> Documentación</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Las páginas de ayuda de los objetos <code>R</code> se escriben usando el
formato “R documentation” (Rd), un lenguaje similar a LaTeX.</li>
<li>Es aconsejable seguir estas orientaciones: <a href="http://developer.r-project.org/Rds.html">Guidelines for Rd files</a></li>
<li>Para generar el esqueleto de un fichero Rd es aconsejable usar:
<ul class="org-ul">
<li><code>prompt</code>: <a href="http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-functions">genérica</a></li>
<li><code>promptClass</code> y <code>promptMethods</code>: <a href="http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-S4-classes-and-methods">clases y métodos</a>.</li>
<li><code>promptPackage</code>: <a href="http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-packages">paquete</a></li>
<li><code>promptData</code>: <a href="http://cran.r-project.org/doc/manuals/r-release/R-exts.html#Documenting-data-sets">datos</a></li>
</ul></li>
<li>Todos los comandos disponibles están en el documento <a href="http://developer.r-project.org/parseRd.pdf">Parsing Rd files</a>.</li>
</ul>
</div>
</div>
