docs/Paquetes.tex

\begin{frame}[fragile,label={sec:org19dfbb1}]{DESCRIPTION}
 \begin{itemize}
\item El fichero DESCRIPTION contiene la información básica:
\end{itemize}
\begin{verbatim}
     Package: pkgname
     Version: 0.5-1
     Date: 2004-01-01
     Title: My First Collection of Functions
     Authors@R: c(person("Joe", "Developer", role = c("aut", "cre"),
                          email = "Joe.Developer@some.domain.net"),
                   person("Pat", "Developer", role = "aut"),
                   person("A.", "User", role = "ctb",
     	             email = "A.User@whereever.net"))
     Author: Joe Developer and Pat Developer, with contributions from A. User
     Maintainer: Joe Developer <Joe.Developer@some.domain.net>
     Depends: R (>= 1.8.0), nlme
     Suggests: MASS
     Description: A short (one paragraph) description of what
       the package does and why it may be useful.
     License: GPL (>= 2)
     URL: http://www.r-project.org, http://www.another.url
\end{verbatim}
\begin{itemize}
\item Los campos \texttt{Package}, \texttt{Version}, \texttt{License}, \texttt{Title}, \texttt{Author} y
\texttt{Maintainer} son obligatorios.
\item Si usa métodos \texttt{S4} debe incluir \texttt{Depends: methods}
\end{itemize}
\end{frame}
\begin{frame}[fragile,label={sec:orga8334be}]{NAMESPACE}
 \begin{itemize}
\item \texttt{R} usa un sistema de gestión de \emph{espacio de nombres} que
permite al autor del paquete especificar:
\begin{itemize}
\item las variables del paquete que se exportan (y son, por tanto,
accesibles a los usuarios)
\item las variables que se importan de otros paquetes.
\item las clases y métodos \texttt{S3} y \texttt{S4} que deben registrarse.
\end{itemize}
\item Este mecanismo queda definido en el contenido del fichero
\texttt{NAMESPACE}.
\end{itemize}
\end{frame}
\begin{frame}[fragile,label={sec:orgace2cff}]{NAMESPACE}
 El \texttt{NAMESPACE} controla la estrategia de búsqueda de variables
  que utilizan las funciones del paquete:
\begin{itemize}
\item En primer lugar busca entre las creadas localmente (por el código de la carpeta \texttt{R/}).
\item En segundo lugar busca entre las variables importadas
explícitamente de otros paquetes.
\item En tercer lugar busca en el \texttt{NAMESPACE} del paquete \texttt{base}.
\item Por último busca siguiendo el camino habitual (ver el
resultado de \texttt{search()})
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:org0902e19}]{NAMESPACE}
 \begin{itemize}
\item Para exportar las variables \texttt{f} y \texttt{g}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
export(f, g)
\end{lstlisting}
\begin{itemize}
\item Para importar \alert{todas} las variables del paquete \texttt{pkgExt}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
import(pkgExt)
\end{lstlisting}
\begin{itemize}
\item Para importar las variables \texttt{var1} y \texttt{var2} del paquete
\texttt{pkgExt}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
importFrom(pkgExt, var1, var2)
\end{lstlisting}
\end{frame}

\begin{frame}[fragile,label={sec:org79e2a3a}]{NAMESPACE}
 \begin{itemize}
\item Para registrar el método \texttt{S3} \texttt{print} para la clase \texttt{myClass}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
S3method(print, myClass)
\end{lstlisting}
\begin{itemize}
\item Para usar clases y métodos \texttt{S4}
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
import("methods")
\end{lstlisting}
\begin{itemize}
\item Para registrar las clases \texttt{S4} \texttt{class1} y \texttt{class2}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
exportClasses(class1, class2)
\end{lstlisting}
\begin{itemize}
\item Para registrar los métodos \texttt{S4} \texttt{method1} y \texttt{method2}:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
exportMethods(method1, method2)
\end{lstlisting}
\begin{itemize}
\item Para importar métodos y clases \texttt{S4} de otro paquete:
\end{itemize}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
importClassesFrom(package, ...)
importMethodsFrom(package, ...)
\end{lstlisting}
\end{frame}

\begin{frame}[fragile,label={sec:org79463fa}]{Documentación}
 \begin{itemize}
\item Las páginas de ayuda de los objetos \texttt{R} se escriben usando el
formato “R documentation” (Rd), un lenguaje similar a \LaTeX{}.
\item Es aconsejable seguir estas orientaciones: \href{http://developer.r-project.org/Rds.html}{Guidelines for Rd files}
\item Para generar el esqueleto de un fichero Rd es aconsejable usar:
\begin{itemize}
\item \texttt{prompt}: \href{http://cran.r-project.org/doc/manuals/r-release/R-exts.html\#Documenting-functions}{genérica}
\item \texttt{promptClass} y \texttt{promptMethods}: \href{http://cran.r-project.org/doc/manuals/r-release/R-exts.html\#Documenting-S4-classes-and-methods}{clases y métodos}.
\item \texttt{promptPackage}: \href{http://cran.r-project.org/doc/manuals/r-release/R-exts.html\#Documenting-packages}{paquete}
\item \texttt{promptData}: \href{http://cran.r-project.org/doc/manuals/r-release/R-exts.html\#Documenting-data-sets}{datos}
\end{itemize}
\item Todos los comandos disponibles están en el documento \href{http://developer.r-project.org/parseRd.pdf}{Parsing Rd files}.
\end{itemize}
\end{frame}
