Paquetes.org
** 
#+begin_example
  \name{load}
  \alias{load}
  \title{Reload Saved Datasets}
  \description{
    Reload the datasets written to a file with the function
    \code{save}.
  }
  \usage{
    load(file, envir = parent.frame())
  }
  \arguments{
  \item{file}{a connection or a character string giving the
      name of the file to load.}
  \item{envir}{the environment where the data should be
      loaded.}
  }
  \seealso{
    \code{\link{save}}.
  }
  \examples{
    ## save all data
    save(list = ls(), file= "all.RData")
    
    ## restore the saved values to the current environment
    load("all.RData")
    
    ## restore the saved values to the workspace
    load("all.RData", .GlobalEnv)
  }
  \keyword{file}
#+end_example

** Ejemplos

- Paquete simple: https://github.com/oscarperpinan/pkgEx
- Paquete con métodos S4: https://github.com/oscarperpinan/birds

* Publicar un paquete

** Itinerario
1. Comprobar
   #+begin_src sh
R CMD check myPackage/
#+end_src
2. Construir
   #+begin_src sh
R CMD build myPackage/
#+end_src
3. Publicar (o actualizar) en un repositorio

** Comprobar
- Comprobar un directorio (desde línea de comandos):
#+begin_src sh
R CMD check myPackage/
#+end_src
- Comprobar un paquete ya construido (desde línea de comandos):
#+begin_src sh
R CMD check myPackage.tar.gz
#+end_src
- Esta comprobación incluye más de 20 puntos de prueba detallados
  en el manual [[http://cran.r-project.org/doc/manuals/R-exts.html#Checking-packages][Writing R extensions]].
** Construir
*** Fuente o binario						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
    Se puede construir un fichero fuente en formato /tarball/
    (independiente de la plataforma, habitual en sistemas Unix) o en
    forma binaria (dependiente de la plataforma, habitual para Windows y Mac).
*** Cómo hacerlo					    :B_ignoreheading:
    :PROPERTIES:
    :BEAMER_env: ignoreheading
    :END:
- Fuente en formato /tarball/: el resultado es un fichero /tarball/ =myPackage.tar.gz= que
     se puede distribuir a cualquier sistema.
#+begin_src sh
R CMD build myPackage/
#+end_src

- Comprimido binario: el resultado es una copia comprimida de la versión
     *instalada* del paquete: depende del sistema operativo.
#+begin_src sh
R CMD INSTALL --build myPackage/
#+end_src


** Comprobar y construir en sistemas Windows

- Para paquetes sin código compilado (C, Fortran), también se puede usar
  =R CMD check= y =R CMD build= en un sistema Windows.
- Para generar un binario hay que usar =R CMD INSTALL --build=.
  - Es posible que haya que modificar la variables de entorno
    =TEMP= y =TMP= de forma que *sólo* contengan caracteres ASCII.
- Para paquetes con código compilado, o en caso de problemas con
  los comandos anteriores, hay que usar [[http://cran.r-project.org/bin/windows/Rtools/][Rtools]].
- Se pueden instalar fuentes /tarball/ con (ver [[http://cran.r-project.org/doc/manuals/R-admin.html#Windows-packages][R installation and administration]]):
#+begin_src sh
install.packages(myPackage.tar.gz, type='source')
#+end_src


** Repositorios: CRAN
El principal repositorio de paquetes estables es [[http://cran.r-project.org/][CRAN]].
  - Publicar en este repositorio conlleva la aceptación de unas [[http://cran.r-project.org/web/packages/policies.html][condiciones]].
  - Para publicar en CRAN hay que subir el fichero fuente /tarball/
    resultado de =R CMD build= mediante el formulario web
    https://cran.r-project.org/submit.html siguiendo los pasos que
    allí se indican.
  - Es imprescindible haber comprobado el fichero con =R CMD check
    --as-cran= antes de subirlo al formulario. El resultado de
    esta comprobación *no* debe contener errores, advertencias o notas.
  - Más detalle en el apartado /Submission/ de las [[http://cran.r-project.org/web/packages/policies.html][condiciones de
    CRAN]].

