docs/Paquetes.html

<div id="outline-container-orgae1e501" class="outline-3">
<h3 id="orgae1e501"><span class="section-number-3">2.8</span> </h3>
<div class="outline-text-3" id="text-2-8">
<pre class="example">
  \name{load}
  \alias{load}
  \title{Reload Saved Datasets}
  \description{
    Reload the datasets written to a file with the function
    \code{save}.
  }
  \usage{
    load(file, envir = parent.frame())
  }
  \arguments{
  \item{file}{a connection or a character string giving the
      name of the file to load.}
  \item{envir}{the environment where the data should be
      loaded.}
  }
  \seealso{
    \code{\link{save}}.
  }
  \examples{
    ## save all data
    save(list = ls(), file= "all.RData")
    
    ## restore the saved values to the current environment
    load("all.RData")
    
    ## restore the saved values to the workspace
    load("all.RData", .GlobalEnv)
  }
  \keyword{file}
</pre>
</div>
</div>

<div id="outline-container-orgc54e117" class="outline-3">
<h3 id="orgc54e117"><span class="section-number-3">2.9</span> Ejemplos</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Paquete simple: <a href="https://github.com/oscarperpinan/pkgEx">https://github.com/oscarperpinan/pkgEx</a></li>
<li>Paquete con métodos S4: <a href="https://github.com/oscarperpinan/pkgMethods">https://github.com/oscarperpinan/pkgMethods</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3be175d" class="outline-2">
<h2 id="org3be175d"><span class="section-number-2">3</span> Publicar un paquete</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org2806c19" class="outline-3">
<h3 id="org2806c19"><span class="section-number-3">3.1</span> Itinerario</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Comprobar</li>
</ul>
<pre class="example">
R CMD check myPackage/
</pre>
<ul class="org-ul">
<li>Construir</li>
</ul>
<pre class="example">
R CMD build myPackage/
</pre>
<ul class="org-ul">
<li>Publicar (o actualizar) en un repositorio</li>
</ul>
</div>
</div>

<div id="outline-container-orgfeeabe5" class="outline-3">
<h3 id="orgfeeabe5"><span class="section-number-3">3.2</span> Comprobar</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Comprobar un directorio (desde línea de comandos):</li>
</ul>
<pre class="example">
R CMD check myPackage/
</pre>
<ul class="org-ul">
<li>Comprobar un paquete ya construido (desde línea de comandos):</li>
</ul>
<pre class="example">
R CMD check myPackage.tar.gz
</pre>
<ul class="org-ul">
<li>Esta comprobación incluye más de 20 puntos de prueba detallados
en el manual <a href="http://cran.r-project.org/doc/manuals/R-exts.html#Checking-packages">Writing R extensions</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-org320836d" class="outline-3">
<h3 id="org320836d"><span class="section-number-3">3.3</span> Construir</h3>
<div class="outline-text-3" id="text-3-3">
</div><ol class="org-ol"><li><a id="org00126db"></a>Fuente o binario&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_block">B_block</span></span><br /><div class="outline-text-4" id="text-3-3-1">
<p>
Se puede construir un fichero fuente en formato <i>tarball</i>
(independiente de la plataforma, habitual en sistemas Unix) o en
forma binaria (dependiente de la plataforma, habitual para Windows y Mac).
</p>
</div></li>
<li><a id="org951453f"></a>Cómo hacerlo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_ignoreheading">B_ignoreheading</span></span><br /><div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>Fuente en formato <i>tarball</i>: el resultado es un fichero <i>tarball</i> <code>myPackage.tar.gz</code> que
se puede distribuir a cualquier sistema.</li>
</ul>
<pre class="example">
R CMD build myPackage/
</pre>
<ul class="org-ul">
<li>Comprimido binario: el resultado es una copia comprimida de la versión
<b>instalada</b> del paquete: depende del sistema operativo.</li>
</ul>
<pre class="example">
R CMD INSTALL --build myPackage/
</pre>
</div></li></ol>
</div>

<div id="outline-container-org2f6eeb9" class="outline-3">
<h3 id="org2f6eeb9"><span class="section-number-3">3.4</span> Comprobar y construir en sistemas Windows</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Para paquetes sin código compilado (C, Fortran), también se puede usar
<code>R CMD check</code> y <code>R CMD build</code> en un sistema Windows.</li>
<li>Para generar un binario hay que usar <code>R CMD INSTALL --build</code>.
<ul class="org-ul">
<li>Es posible que haya que modificar la variables de entorno
<code>TEMP</code> y <code>TMP</code> de forma que <b>sólo</b> contengan caracteres ASCII.</li>
</ul></li>
<li>Para paquetes con código compilado, o en caso de problemas con
los comandos anteriores, hay que usar <a href="http://cran.r-project.org/bin/windows/Rtools/">Rtools</a>.</li>
<li>Se pueden instalar fuentes <i>tarball</i> con (ver <a href="http://cran.r-project.org/doc/manuals/R-admin.html#Windows-packages">R installation and administration</a>):</li>
</ul>
<pre class="example">
install.packages(myPackage.tar.gz, type='source')
</pre>
</div>
</div>


<div id="outline-container-orgfca5124" class="outline-3">
<h3 id="orgfca5124"><span class="section-number-3">3.5</span> Repositorios: CRAN</h3>
<div class="outline-text-3" id="text-3-5">
<p>
El principal repositorio de paquetes estables es <a href="http://cran.r-project.org/">CRAN</a>.
</p>
<ul class="org-ul">
<li>Publicar en este repositorio conlleva la aceptación de unas <a href="http://cran.r-project.org/web/packages/policies.html">condiciones</a>.</li>
<li>Para publicar en CRAN hay que subir el fichero fuente <i>tarball</i>
resultado de <code>R CMD build</code> mediante el formulario web
<a href="https://cran.r-project.org/submit.html">https://cran.r-project.org/submit.html</a> siguiendo los pasos que
allí se indican.</li>
<li>Es imprescindible haber comprobado el fichero con <code>R CMD check
    --as-cran</code> antes de subirlo al formulario. El resultado de
esta comprobación <b>no</b> debe contener errores, advertencias o notas.</li>
<li>Más detalle en el apartado <i>Submission</i> de las <a href="http://cran.r-project.org/web/packages/policies.html">condiciones de
CRAN</a>.</li>
</ul>
</div>
</div>
