docs/Paquetes.tex

\begin{frame}[fragile,label={sec:org638d3cb}]{}
 \begin{verbatim}
  \name{load}
  \alias{load}
  \title{Reload Saved Datasets}
  \description{
    Reload the datasets written to a file with the function
    \code{save}.
  }
  \usage{
    load(file, envir = parent.frame())
  }
  \arguments{
  \item{file}{a connection or a character string giving the
      name of the file to load.}
  \item{envir}{the environment where the data should be
      loaded.}
  }
  \seealso{
    \code{\link{save}}.
  }
  \examples{
    ## save all data
    save(list = ls(), file= "all.RData")
    
    ## restore the saved values to the current environment
    load("all.RData")
    
    ## restore the saved values to the workspace
    load("all.RData", .GlobalEnv)
  }
  \keyword{file}
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org0791855}]{Ejemplos}
\begin{itemize}
\item Paquete simple: \url{https://github.com/oscarperpinan/pkgEx}
\item Paquete con métodos S4: \url{https://github.com/oscarperpinan/pkgMethods}
\end{itemize}
\end{frame}

\section{Publicar un paquete}
\label{sec:org54c4e32}

\begin{frame}[fragile,label={sec:org8f0cb2c}]{Itinerario}
 \begin{itemize}
\item Comprobar
\end{itemize}
\begin{verbatim}
R CMD check myPackage/
\end{verbatim}
\begin{itemize}
\item Construir
\end{itemize}
\begin{verbatim}
R CMD build myPackage/
\end{verbatim}
\begin{itemize}
\item Publicar (o actualizar) en un repositorio
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgaba8a59}]{Comprobar}
 \begin{itemize}
\item Comprobar un directorio (desde línea de comandos):
\end{itemize}
\begin{verbatim}
R CMD check myPackage/
\end{verbatim}
\begin{itemize}
\item Comprobar un paquete ya construido (desde línea de comandos):
\end{itemize}
\begin{verbatim}
R CMD check myPackage.tar.gz
\end{verbatim}
\begin{itemize}
\item Esta comprobación incluye más de 20 puntos de prueba detallados
en el manual \href{http://cran.r-project.org/doc/manuals/R-exts.html\#Checking-packages}{Writing R extensions}.
\end{itemize}
\end{frame}
\begin{frame}[fragile,label={sec:orgf872757}]{Construir}
 \begin{block}{Fuente o binario}
Se puede construir un fichero fuente en formato \emph{tarball}
(independiente de la plataforma, habitual en sistemas Unix) o en
forma binaria (dependiente de la plataforma, habitual para Windows y Mac).
\end{block}
\begin{itemize}
\item Fuente en formato \emph{tarball}: el resultado es un fichero \emph{tarball} \texttt{myPackage.tar.gz} que
se puede distribuir a cualquier sistema.
\end{itemize}
\begin{verbatim}
R CMD build myPackage/
\end{verbatim}
\begin{itemize}
\item Comprimido binario: el resultado es una copia comprimida de la versión
\alert{instalada} del paquete: depende del sistema operativo.
\end{itemize}
\begin{verbatim}
R CMD INSTALL --build myPackage/
\end{verbatim}
\end{frame}

\begin{frame}[fragile,label={sec:org68f87c8}]{Comprobar y construir en sistemas Windows}
 \begin{itemize}
\item Para paquetes sin código compilado (C, Fortran), también se puede usar
\texttt{R CMD check} y \texttt{R CMD build} en un sistema Windows.
\item Para generar un binario hay que usar \texttt{R CMD INSTALL -{}-build}.
\begin{itemize}
\item Es posible que haya que modificar la variables de entorno
\texttt{TEMP} y \texttt{TMP} de forma que \alert{sólo} contengan caracteres ASCII.
\end{itemize}
\item Para paquetes con código compilado, o en caso de problemas con
los comandos anteriores, hay que usar \href{http://cran.r-project.org/bin/windows/Rtools/}{Rtools}.
\item Se pueden instalar fuentes \emph{tarball} con (ver \href{http://cran.r-project.org/doc/manuals/R-admin.html\#Windows-packages}{R installation and administration}):
\end{itemize}
\begin{verbatim}
install.packages(myPackage.tar.gz, type='source')
\end{verbatim}
\end{frame}


\begin{frame}[fragile,label={sec:org5a69310}]{Repositorios: CRAN}
 El principal repositorio de paquetes estables es \href{http://cran.r-project.org/}{CRAN}.
\begin{itemize}
\item Publicar en este repositorio conlleva la aceptación de unas \href{http://cran.r-project.org/web/packages/policies.html}{condiciones}.
\item Para publicar en CRAN hay que subir el fichero fuente \emph{tarball}
resultado de \texttt{R CMD build} mediante el formulario web
\url{https://cran.r-project.org/submit.html} siguiendo los pasos que
allí se indican.
\item Es imprescindible haber comprobado el fichero con \texttt{R CMD check
    -{}-as-cran} antes de subirlo al formulario. El resultado de
esta comprobación \alert{no} debe contener errores, advertencias o notas.
\item Más detalle en el apartado \emph{Submission} de las \href{http://cran.r-project.org/web/packages/policies.html}{condiciones de
CRAN}.
\end{itemize}
\end{frame}
